{
	"|SC/MATH 3280|": {
		"title": "Mathematics of Life Contingencies I",
		"note": "Enrolled in Part-2-",
		"description": "Probabilistic introduction to the mathematics of life contingencies. The course develops a theoretical basis for modeling the future lifetime of certain financial objects with an emphasis on insurance. Topics include international actuarial notation, life tables, life statuses, (multivariate) survival distributions, dependence, multiple decrement theory.",
		"type": "mathematics"
		},
	"|SC/MATH 2280|": {
		"title": "The Mathematical Theory of Interest",
		"note": "",
		"description": "Topics include measurement of interest, annuities, amortization of loans, bonds, sinking funds and depreciation.",
		"type": "mathematics"
		},
	"|SC/MATH 2281|": {
		"title": "Financial Economics",
		"note": "",
		"description": "A quantitative introduction to financial economics. The topics include arbitrage pricing theory, forwards and futures, American and European options, interest rate derivatives, yield curves, arbitrage hedging and pricing, put-call parity, arbitrage bounds, binomial model, Black-Scholes formula, risk-neutral valuation, trinomial model.",
		"type": "mathematics"
		},
	"|SC/MATH 3131|": {
		"title": "Mathematical Statistics I",
		"note": "",
		"description": "Topics include common density functions, probability functions, principle of likelihood, the likelihood function, the method of maximum likelihood, likelihood regions, tests of hypotheses, likelihood ratio tests, goodness of fit tests, conditional tests and confidence sets with a view towards applications.",
		"type": "mathematics"
		},
	"|SC/MATH 2001|": {
		"title": "Real Analysis l",
		"note": "",
		"description": "Axioms for, and properties of, the real numbers; sequences; functions of a real variable, continuity, and differentiation. Rigorous definitions of convergence and limit underpin a proof-based treatment of the subject material. Intended for Honours students in Mathematics.",
		"type": "mathematics"
		},
	"|SC/MATH 2022|": {
		"title": "Linear Algebra II",
		"note": "",
		"description": "Inner product spaces, linear transformations, eigenvalues, diagonalization, least squares, quadratic forms and Markov chains.",
		"type": "mathematics"
		},
	"|SC/MATH 3090|": {
		"title": "Computational Mathematics",
		"note": "",
		"description": "Modelling (discrete and continuous, deterministic and stochastic) and practical solutions to general categories of applied problems. Case studies of solutions through modelling and representation of data. Implementation, numerical considerations, efficiency, and application of numerical algorithms.",
		"type": "mathematics"
		},
	"|AP/ECON 4400|": {
		"title": "Financial Economics",
		"note": "Enrolled: not taken. VEE Course",
		"description": "Analyzes investment and financing decisions, the separation between ownership and control, the risk inherent in decision-making, and how shareholders wealth and utility are maximized. Topics include net present value, capital budgeting, efficiency of capital markets, treatment of risk, valuation of debt, dividend policy, short-term financing, and financial strategy.",
		"type": "economics"
		},
	"|AP/ECON 2350|": {
		"title": "Intermediate Microeconomic Theory II",
		"note": "",
		"description": "Applies the analytical tools from previous courses to analyze resource allocation in imperfectly competitive markets and factor pricing in alternative market structures. Considers basic concepts of general equilibrium and welfare economics.",
		"type": "economics"
		}
}